In [4]:
import pandas as pd

### Create Data

In [12]:
data = {
    'Name':['Pandy','Sandy','Randy','Mandy','Candy','Landy'],
    'Age':[6,7,4,5,4,2],
    'Bamboo Stick': [10,15,20,25,30,35]
}

In [13]:
df=pd.DataFrame(data)

In [14]:
df

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Head (first five rows)

In [13]:
df.head()

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30

In [10]:
df.head(2)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15

### Tail (last five rows)

In [14]:
df.tail()

    Name  Age  Bamboo Stick
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [11]:
df.tail(3)

    Name  Age  Bamboo Stick
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Filtering

In [15]:
df[df['Age']<5]

    Name  Age  Bamboo Stick
2  Randy    4            20
4  Candy    4            30
5  Landy    2            35

df[df['Age']<5] 
df, data frame name used for filtering
[df['Age']<5] is the logic

#### double filtering

### Add Column

In [64]:
df['Place']=['Greenland', 'Siberia', 'Antartica','Greenland', 'Siberia', 'Antartica']

In [65]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### Update

In [21]:
df.loc[df['Name']== 'Pandy', 'Age']=6

In [22]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

df.loc is the function name, df is the name of the dataframe
[df['Name']== 'Pandy', 'Age'] tracks row location
['Name']== 'Pandy' Row information
=6 is the updated value

### Delete

#### Delete one Column

In [25]:
df.drop('Place',axis=1)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [28]:
#### Delete multiple Column

In [30]:
#df.drop(['Place','Bamboo Stick'],axis=1)

    Name  Age
0  Pandy    6
1  Sandy    7
2  Randy    4
3  Mandy    5
4  Candy    4
5  Landy    2

#### Delete Row

In [61]:
df

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [63]:
 df.drop(df[df['Name'] == 'Candy'].index)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
5  Landy    2            35

✅ df[df['Name'] == 'Sandy'].index gives you the actual row index/indices where Name == 'Sandy'.
🔍 .index in pandas is used to access the row labels (i.e., the indices) of a DataFrame or Series.

In [66]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### show row data

In [67]:
df.iloc[2]

Name                Randy
Age                     4
Bamboo Stick           20
Place           Antartica
Name: 2, dtype: object

In [68]:
df.iloc[:3]

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [69]:
df.iloc[1:3]

    Name  Age  Bamboo Stick      Place
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

### show coulmn data

In [70]:
df ['Place']

0    Greenland
1      Siberia
2    Antartica
3    Greenland
4      Siberia
5    Antartica
Name: Place, dtype: object

#### row and column

In [71]:
df.iloc [0:2,1:3]

   Age  Bamboo Stick
0    6            10
1    7            15

###  New index

In [1]:
import pandas as pd

df = pd.DataFrame(
    {
        'Name': ['Pandy', 'Sandy', 'Randy', 'Mandy', 'Candy', 'Landy'],
        'Age': [6, 7, 4, 5, 4, 2],
        'Bamboo Stick': [10, 15, 20, 25, 30, 35]
    },
    index=['a', 'b', 'c', 'd', 'e', 'f']
)

In [2]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

#### column

In [3]:
df.loc['b']

Name            Sandy
Age                 7
Bamboo Stick       15
Name: b, dtype: object

#### both row & column

In [8]:
df.loc[['b','c'], ['Name','Age']]

    Name  Age
b  Sandy    7
c  Randy    4

### Conevrt to csv

In [7]:
df.to_csv('panda.csv')

We would see a csv file on the local folder

#### No index

In [9]:
df.to_csv('noIndex_panda.csv', index=False)

In [15]:
df

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Statistical Analysis

In [17]:
df.describe()

            Age  Bamboo Stick
count  6.000000      6.000000
mean   4.666667     22.500000
std    1.751190      9.354143
min    2.000000     10.000000
25%    4.000000     16.250000
50%    4.500000     22.500000
75%    5.750000     28.750000
max    7.000000     35.000000